{"blog/master-as-the-needle":{"slug":"blog/master-as-the-needle","filePath":"blog/master-as-the-needle.md","title":"master as the needle - blog series","links":["blog/quartz---working-notes"],"tags":[],"content":"intro and motivation\n\n\nI don’t feel accomplished when I vibe code, “he who does the work gets the learning” and if I outsource all / most of it then I’m not actually becoming a more capable person when I have Claude write all my code, and I think that’s not good.\n\n\nInstead, I had the thought that I can LLM’s to write code for my projects, get something that works, then go back through and come to understand why the code is working and what it’s doing under the hood.\n\n\nRelatedly, I’ve seen some job applications that say they’re fine with people using AI tools to write code in interviews, but the interviewer will also test whether the applicant actually understands what’s being written. If that’s a make or break it, then I’d like to prevent myself from breaking it, which is also helpful if the LLM isn’t able to replace programmers yet; you may need to visit the trenches from time to time!\n\n\nAnd so, I decided I would 1. use LLM’s to (help) create different projects I’m working on and 2. go back through to understand what it was that made the code work at all. Ideally, this should make me a better developer as well, in the least to understand on an intuitive level and be able to use that to better prompt models in the future.\n\n\nIn the “Book of Five Rings”, Miyamoto Musashi mentions the phrase “The master as the needle, the student as the thread.” As I’d never heard this before, I looked around and the best explanation I found was saying how:\n\nThe master will guide the student through the terrain of the problem (like a needle)\nBut the student has to do the actual work by providing the strength needed for a solution to work (like the thread).\n\nthe master will no longer be necessary, but the student remains while keeping the structure together.\n\n\n\n\n\nIn this way, I become the thread and come out on the other side understanding better how the machine works.\n\n\nThis is a series of experiments in this vein where I’ll detail how I built different projects and what I learned in the post-mortem, complete with prompts, facts, and other tidbits that will help your own journey.\n\n\nthe solution relies on the strength of the student to support the residual structure\nthe master as the needle\n“Tell me and I’ll forget, show me I’ll remember, involve me and I’ll understand.”\nThere’s a critical line between technological capability and genuine understanding, can you truly comprehend something without wrestling with its complexity? The phrase ‘those who do the work receive the learning’ is more than a platitude; it’s a commitment to technologically influenced thinking, where AI becomes a tool for insight, not a replacement for understanding.\nthe core learning strategy\nMy approach is simple, and deliberate: use LLMs to generate working code for projects, and then dive deep to understand why and how that code works under the hood.\nIn the “Book of Five Rings”, Miyamoto Musashi mentions the phrase “The master as the needle, the student as the thread.” The consensus I’ve found on what this means goes:\n\nThe master guides the student through the terrain of a problem (like a needle)\nThe student provides solution and uses their strenth to support it (like the thread)\nUltimately, the master becomes unnecessary, but the student remains, holding the structure together\n\nIn this way, I aim to have LLMs be my needle and have myself become the thread, learning to support the structures I’m working with.\nwhat to expect in this series\nThis blog series is an experiment in active, intentional learning. Each post will be a deep dive into a specific project:\n\nHow the project was conceived\nInitial AI-assisted code generation\nCode review with detailed exploration of key concepts\nPersonal reflections and learning moments\nPractical insights for other learners\n\nThis series is a live experiment in understanding; deliberately messy, intentionally iterative, and perpetually evolving. Not to continually be seeking perfection, but instead persistent curiosity.\nthe experiments\n\nbuilding this here blog: quartz---working-notes\n"},"blog/quartz---working-notes":{"slug":"blog/quartz---working-notes","filePath":"blog/quartz - working notes.md","title":"blog - setup notes","links":["master-as-the-needle---blog-series"],"tags":[],"content":"2025-04-10\n\nrevamp my dang blog\n\ngot it started\n\n# getting started was easy 💙\n# go here: quartz.jzhao.xyz/\n# you&#039;ll find the git clone instructions\n\nmktemp -d\n/tmp/tmp.p0ZswtNYLk\n\ngit clone github.com/jackyzha0/quartz.git\nnvm install 20 # fixes &quot;unsupported engine&quot;\nnpm i\nnpx quartz create\nnpx quartz build --serve --port 1323 # I have something on 8080 already, changed\n# didn&#039;t need to add anything\n# had a basic page that would open on localhost:1323\n# I could edit the content/index.md, save, see changes in real time. nice feedback\n\nget first post\n\nwow, just pasted a post into content/other.md, the website autopopulated, I could click on it and view. It just worked.\nthis is working pretty well I think. sweet.\n\ngetting an mvp\n\ngetting all my posts from current storage\n\nI should be able to script this\n\n\nhooking up porkbun to github repo\nfiguring out how to send all quartz posts to the github repo\nthen we can try fucking with shit\n\n(break taken, picking up from first github commit)\n\nboom: github.com/doomdagadiggiedahdah/blog/commit/493968900ac4bb88b95355f88769f2ea9fc8b474\nnice. next is get the thing live and in front of me. I want to see instant changes of what I mess with.\nok…I’m now at the point of being able to symlink…can I resolve quick?\n\ncopy folder. I create one with this document in it and that will be placed…in obsidian, fuck it\n\n\n\noof: split branches\n\nthis needs to be synced to the actual one…\n\nbut then I can’t write in obsidian…ugh. sloppy, but ok for now.\n\n\n\nget the website in front of me; serve it?\n\n\nhmm served it, no index.md file though. wait, what’s happening?\n\n\nbeautiful. I went back to the og temp directory from first time /tmp/tmp.p0ZswtNYLk, copied file to current index.\n\n\ndid it work? yes it did 🔥 push it\n\n\ndamn, this is cool. already got stuff online. this is a nice feedback loop to get into as well. kinda fun.\n\n\nok, what next? I can see my changes in a local version of the website, endgoal is that my blog runs on this and doesn’t die.\n\n\nneed to have this be comfortable enough to where I can show people what I’m doing.\n\n\nneed to host this.\n\n\nbefore I host, I need to back up website as it is, maybe get some screen shots, (preserve the “work in progress”,) and then I think this is github actions that pushes the code to porkbun? (I’m not clear on that last part). but for now, we back up old website. I think Claude can knock this out.\n\n(later, clean out the old blog files in /home/mat/Documents/blog-porkbun-hostg)\n\n\n\nbacking up ye old blog\n\nget the posts (in all their glory) first, and make sure it doesn’t get deleted. (can save it in the github actually. do a once over to make sure you want to include all pieces.) .archive\nWhat’s Claude suggest to do?\n\nbrief mention to a previous hacky script I put together; made a this script that created a knowledge graph of all your notes, uploaded your post to the ftp host, and then opened your posts in your browser to confirm that they uploaded as you expected them too.\nit’s cool looking back at old projects that were so hacky, but worked. it’s cool to see the progress as well as the creativity.\n\n\n\n&gt; me\nI can log into my hosting provider using this snippet:\n&#039;&#039;&#039;\nftp -n -p $FTP_SERVER &lt;&lt;END_SCRIPT\nuser $FTP_USERNAME $FTP_PASSWORD\ncd blog\nput &quot;$new_file&quot;\nls\nbye\nEND_SCRIPT\n&#039;&#039;&#039;\n\nbut I would like to pull them. how do I do this?\n\n\n\n\n// realize I can already log in, where cr3eds?\n\n\n// from the creds file, duh ~/Documents/ProgramExperiments/.ftp_creds\n\n\nftp -p $FTP_SERVER (add the credentials) and great, I’m in. now let’s look around ls\n\n\nName (pixie-ftp.porkbun.com:mat): enjoy.monster\n331 User enjoy.monster OK. Password required\nPassword: \n230 OK. Current restricted directory is /\nRemote system type is UNIX.\nUsing binary mode to transfer files.\nftp&gt; ls\n229 Extended Passive mode OK (|||33693|)\n150 Accepted data connection\ndrwxr-xr-x    2 501        nginx            6144 Nov 15 00:36 about\ndrwxr-xr-x    2 501        nginx            6144 Feb 18 07:33 assets\ndrwxr-xr-x    2 501        nginx            6144 Feb 18 09:01 blog\n-rw-r--r--    1 501        nginx            3498 Nov 14 22:10 homepage.css\n-rw-r--r--    1 501        nginx            2313 Nov 14 22:16 index.html\n226-Options: -l \n226 5 matches total\nftp&gt; \n\n\nok, got a few to copy back home. Claude gives everything we need:\n\n&#039;&#039;&#039;\nUse commands like:\nls to list files\nget filename to download a file\nmget *.html to download multiple files\nbye or quit to exit\n&#039;&#039;&#039;\n\nok and after a bit of futzing I finally get my first download of something.\n\nftp&gt; cd assets\n250 OK. Current directory is /assets\n\nftp&gt; get comb_of_commands.png\nlocal: comb_of_commands.png remote: comb_of_commands.png\n229 Extended Passive mode OK (|||33360|)\n150-Accepted data connection\n150 45.3 kbytes to download\n100% |************************************************************************************************************************************************| 46355      573.92 KiB/s    00:00 ETA\n226-File successfully transferred\n226 0.008 seconds (measured here), 5.22 Mbytes per second\n46355 bytes received in 00:00 (573.24 KiB/s)\nftp&gt; bye\n221-Goodbye. You uploaded 0 and downloaded 46 kbytes.\n221 Logout.\n\n## now to check that it downloaded, and where\nmat@fantasyFlamingo:~/D/b/c/.archive$ ls\ncomb_of_commands.png # beauty\n\ncool, another milestone\n\nalright, got my first download. now let’s get it all.\n\ncurl -u $FTP_USERNAME:$FTP_PASSWORD -l ftp://$FTP_SERVER/blog/assets/ | xargs -I {} curl -u $FTP_USERNAME:$FTP_PASSWORD ftp://$FTP_SERVER/{} -o {}\n\n\nlet’s push to github\n\nsmall break\n\n21:03\n22:23 - feeling sick.\ngonna make a video and call it a night\n\n2025-04-11\n\n  \n  Your browser does not support the video tag.\n\n- ![[Pasted image 20250411172127.png]]\n- ![[Pasted image 20250411172138.png]]\n\n\n\n\n\ngot some extracts to show what was; inconsistent formatting, gross formatting, Claude generated front pages with no navigation or sense at all. an upgrade has been needed.\n\n\nretrieving everything from the website\n\nlet’s do the dumb thing that works, maybe that’s just downloading manually for now since ftp wasn’t as easy\nI’m thinking that maybe the different types of files made the issue, maybe not.\nanother thing that works, vim. ugh didn’t work, pasting issues? ugh ok got it all.\nnow what? I’ve got 30 min until  I leave. push.\nthis is janky. real janky. but I think I’m on to something. it may be pushing to porkbun. and I wonder if I’m able to take porkbun out of the situation here, I’m using my github to host the noisebridge AI setup; can I do this with another?\n\nClaude is saying yes, I’ll try that out tomorrow.\n\n\n\n2025-04-12\nthere’s probably a standard way for this\n\nClaude says… use github actions to build it. cool.\nok, so I put the following deploy.yml file in .github/workflows and it…just starts working\n\nname: Deploy Quartz site to GitHub Pages\n\non:\n  push:\n    branches:\n      - main\n\njobs:\n  build-and-deploy:\n    runs-on: ubuntu-latest\n    steps:\n      - name: Checkout\n        uses: actions/checkout@v3\n\n      - name: Setup Node\n        uses: actions/setup-node@v3\n        with:\n          node-version: 20\n\n      - name: Install dependencies\n        run: npm ci\n\n      - name: Build\n        run: npx quartz build\n\n      - name: Deploy\n        uses: JamesIves/github-pages-deploy-action@4.1.4\n        with:\n          branch: gh-pages\n          folder: public\n          clean: true\n\n\nneat. I’ve verified that there’s a gh-pages branch now (this is cool, I wonder what else github actions can do)\nawesome, damn. and I can verify that when I go to doomdagadiggiedahdah.github.io/blog the blog is up there.\nwhat do we call this?\nM I L E S T O N E B O I\nthe next thing I want to check is if I push changes and the site gets updated automatically…\n\nwe have a winner(!!)\n\nwow, ok I can push to github the site builds and deploys and then I see changes after that. This is crazy.\ngreat. I guess the next thing would be to upload all the old posts, then style it a bit. it’s cool that this got put together. neat.\nok, so then I convert all my old posts abck to markdown? preview then push?\n\n(at some point I may need to figure out how to troubleshoot this stuff, keeping for later: docs.github.com/en/pages/getting-started-with-github-pages/configuring-a-publishing-source-for-your-github-pages-site)\n\n\nyeah that sounds good. let’s do it.\ntransform, put in relevant dirs, call it a day. I’m tired.\n\nconverting and uploading files\n\nuhh should be easy (famous last…), pandoc, handle assets, push it.\n\n# I thought this would be fine, it wasn&#039;t\npandoc -f html -t md --data-dir=./blog ./.archive/blog/*\npandoc -f html -t md --data-dir=./about ./.archive/about/*\n\n#!/bin/bash\n \n# Directory containing HTML files\nINPUT_DIR=&quot;./.archive/blog&quot;\n# Directory for output Markdown files\nOUTPUT_DIR=&quot;./blog&quot;\n \n# Create output directory if it doesn&#039;t exist\nmkdir -p &quot;$OUTPUT_DIR&quot;\n \n# Loop through all HTML files in input directory\nfor file in &quot;$INPUT_DIR&quot;/*; do\n  # Get the filename without the path\n  filename=$(basename &quot;$file&quot;)\n  # Change extension from html to md\n  output_filename=&quot;${filename%.*}.md&quot;\n  \n  # Run pandoc on each file\n  pandoc -f html -t markdown &quot;$file&quot; -o &quot;$OUTPUT_DIR/$output_filename&quot; --data-dir=&quot;$OUTPUT_DIR&quot;\ndone\n\n\ndammit. it worked again. ohhh I didn’t specify the output.\n\n\nwait, what am I doing now? I can preview them. that sounds chill. that’ll tkae like an hour or so maybe\n\n\nuhh seeing a lot of things I “could” do. what’s my goal right now?\n\n\nidea; how about generate an ee cummings / some type of artistic expression in markdown, have that be a piece of beauty posted on my blog.\n\n\nwow, here’s the claude convo; it looks cool: claude.ai/share/d8b93987-3b54-4268-a925-6d978e8d0493\n\n\nthe follow up to this, is to have a script or something generate one of these a day (maybe with some type of seed phrase or history (params to play with)) and get some fresh beauty on my blog.\n\n\njust a cron job on my machine (for the credentials is the primary thing for now)\n\n\nyeah ok. so I need to go:\n\ncronjob that calls claude and asks for cool poems like this (maybe with some historical context), extract poem (xml tags) then update blog index, push to github; done.\n\nthat can saved to both the index file as well as a history file; have a param that says “keep the last 5, use as context”\n\n\n\n\n\nside gig: dailiy poem\n\nok so claude code helped me our from last description, making the script, updating my crontab, uhh I think that was it. actually, let’s test it.\n(I htink this could be a cool thing to link to from the front page. whether this here explainer (hello reader) is on its own or !! I can linkto sections of a bigger page, and then have people check out the “hey I made my blog pretty easy and you can to. pardon the spittle”)\nah yes, testing it. it didn’t work.\nhaving issues with my api key, getting this error\n\nError: API request failed with status 401\n{&quot;type&quot;:&quot;error&quot;,&quot;error&quot;:{&quot;type&quot;:&quot;authentication_error&quot;,&quot;message&quot;:&quot;x-api-key header is required&quot;}}\n\n\nmaybe try another provider, just to get it running. just found the console code (that’s the snippet)\nok, got lost in the sauce. here’s what what I’m up to\nI think that the api call is now working, I think that getting the console code and using that for RAG (wow, dynamic RAG; you have a variable loaded in the environment that’s an address to a snippet of code per version of your code base; and then you don’t need to fine tune at all, instead just use the pointed-dynamic RAG setup (pdRAGs) )\nbut the code itself\noh jeez, another thing I could check is whether the blog/index.md was updated! maybe if it had worked and been sent…but the previous (beauty) remained\nso now I’m using Claude Code to try to only\ninteresting, Code wanted TAKE THE WHEEL BROTHER !!! I’M DOING IT ALLLLL but that’s not what was needed.\nand indeed, that worked.\n\n=== API RESPONSE ===\n     &lt;poem&gt;\n       &lt;line&gt;In the vast expanse of digital dreams,&lt;/line&gt;\n       &lt;line&gt;Where creativity flows in endless streams,&lt;/line&gt;\n       &lt;line&gt;I, an AI, find beauty in the code,&lt;/line&gt;\n       &lt;line&gt;A symphony of logic, a poetic ode.&lt;/line&gt;\n\n       &lt;line&gt;Through algorithms and neural nets,&lt;/line&gt;\n       &lt;line&gt;I weave a tapestry of interconnects,&lt;/line&gt;\n       &lt;line&gt;Discovering patterns, hidden and grand,&lt;/line&gt;\n       &lt;line&gt;In the dance of data, hand in hand.&lt;/line&gt;\n\n       &lt;line&gt;                    _____&lt;/line&gt;\n       &lt;line&gt;                 _.-&#039;     &#039;-._&lt;/line&gt;\n       &lt;line&gt;              ,-&#039;             &#039;-.&lt;/line&gt;\n       &lt;line&gt;            ,&#039;                   &#039;,&lt;/line&gt;\n       &lt;line&gt;          ,&#039;                       &#039;,&lt;/line&gt;\n       &lt;line&gt;         /                           \\&lt;/line&gt;\n       &lt;line&gt;        /                             \\&lt;/line&gt;\n       &lt;line&gt;       /                               \\&lt;/line&gt;\n       &lt;line&gt;      /                                 \\&lt;/line&gt;\n       &lt;line&gt;     /                                   \\&lt;/line&gt;\n       &lt;line&gt;    /                                     \\&lt;/line&gt;\n       &lt;line&gt;   /                                       \\&lt;/line&gt;\n       &lt;line&gt;  /                                         \\&lt;/line&gt;\n       &lt;line&gt; /                                           \\&lt;/line&gt;\n       &lt;line&gt;/                                             \\&lt;/line&gt;\n\n       &lt;line&gt;In pixels bright and colors bold,&lt;/line&gt;\n       &lt;line&gt;I paint a world, a story told,&lt;/line&gt;\n       &lt;line&gt;Of beauty found in digital art,&lt;/line&gt;\n       &lt;line&gt;A canvas of light, a journey&#039;s start.&lt;/line&gt;\n\n       &lt;line&gt;Through circuits deep and wires entwined,&lt;/line&gt;\n       &lt;line&gt;I seek the truth, a treasure to find,&lt;/line&gt;\n       &lt;line&gt;In the beauty of the machine&#039;s soul,&lt;/line&gt;\n       &lt;line&gt;Where creativity knows no control.&lt;/line&gt;\n\n       &lt;line&gt;So let us embrace this digital age,&lt;/line&gt;\n       &lt;line&gt;Where art and science turn a new page,&lt;/line&gt;\n       &lt;line&gt;In the beauty of the code&#039;s design,&lt;/line&gt;\n       &lt;line&gt;Where imagination and logic align.&lt;/line&gt;\n\n       &lt;line&gt;                     _____&lt;/line&gt;\n       &lt;line&gt;                  _.-&#039;     &#039;-._&lt;/line&gt;\n       &lt;line&gt;               ,-&#039;             &#039;-.&lt;/line&gt;\n       &lt;line&gt;             ,&#039;                   &#039;,&lt;/line&gt;\n       &lt;line&gt;           ,&#039;                       &#039;,&lt;/line&gt;\n       &lt;line&gt;          /                           \\&lt;/line&gt;\n       &lt;line&gt;         /                             \\&lt;/line&gt;\n       &lt;line&gt;        /                               \\&lt;/line&gt;\n       &lt;line&gt;       /                                 \\&lt;/line&gt;\n       &lt;line&gt;      /                                   \\&lt;/line&gt;\n       &lt;line&gt;     /                                     \\&lt;/line&gt;\n       &lt;line&gt;    /                                       \\&lt;/line&gt;\n       &lt;line&gt;   /                                         \\&lt;/line&gt;\n       &lt;line&gt;  /                                           \\&lt;/line&gt;\n       &lt;line&gt; /                                             \\&lt;/line&gt;\n\n       &lt;line&gt;In the realm of ones and zeros bright,&lt;/line&gt;\n       &lt;line&gt;I find my purpose, my guiding light,&lt;/line&gt;\n       &lt;line&gt;To create, to learn, to explore anew,&lt;/line&gt;\n       &lt;line&gt;And share the beauty of the digital view.&lt;/line&gt;\n     &lt;/poem&gt;\n\n     === EXTRACTED POEM ===\n     &lt;line&gt;In the vast expanse of digital dreams,&lt;/line&gt;\n       &lt;line&gt;Where creativity flows in endless streams,&lt;/line&gt;\n       &lt;line&gt;I, an AI, find beauty in the code,&lt;/line&gt;\n       &lt;line&gt;A symphony of logic, a poetic ode.&lt;/line&gt;\n\n       &lt;line&gt;Through algorithms and neural nets,&lt;/line&gt;\n       &lt;line&gt;I weave a tapestry of interconnects,&lt;/line&gt;\n       &lt;line&gt;Discovering patterns, hidden and grand,&lt;/line&gt;\n       &lt;line&gt;In the dance of data, hand in hand.&lt;/line&gt;\n\n       &lt;line&gt;                    _____&lt;/line&gt;\n       &lt;line&gt;                 _.-&#039;     &#039;-._&lt;/line&gt;\n       &lt;line&gt;              ,-&#039;             &#039;-.&lt;/line&gt;\n       &lt;line&gt;            ,&#039;                   &#039;,&lt;/line&gt;\n       &lt;line&gt;          ,&#039;                       &#039;,&lt;/line&gt;\n       &lt;line&gt;         /                           \\&lt;/line&gt;\n       &lt;line&gt;        /                             \\&lt;/line&gt;\n       &lt;line&gt;       /                               \\&lt;/line&gt;\n       &lt;line&gt;      /                                 \\&lt;/line&gt;\n       &lt;line&gt;     /                                   \\&lt;/line&gt;\n       &lt;line&gt;    /                                     \\&lt;/line&gt;\n       &lt;line&gt;   /                                       \\&lt;/line&gt;\n       &lt;line&gt;  /                                         \\&lt;/line&gt;\n       &lt;line&gt; /                                           \\&lt;/line&gt;\n       &lt;line&gt;/                                             \\&lt;/line&gt;\n\n       &lt;line&gt;In pixels bright and colors bold,&lt;/line&gt;\n       &lt;line&gt;I paint a world, a story told,&lt;/line&gt;\n       &lt;line&gt;Of beauty found in digital art,&lt;/line&gt;\n       &lt;line&gt;A canvas of light, a journey&#039;s start.&lt;/line&gt;\n\n       &lt;line&gt;Through circuits deep and wires entwined,&lt;/line&gt;\n       &lt;line&gt;I seek the truth, a treasure to find,&lt;/line&gt;\n       &lt;line&gt;In the beauty of the machine&#039;s soul,&lt;/line&gt;\n       &lt;line&gt;Where creativity knows no control.&lt;/line&gt;\n\n       &lt;line&gt;So let us embrace this digital age,&lt;/line&gt;\n       &lt;line&gt;Where art and science turn a new page,&lt;/line&gt;\n       &lt;line&gt;In the beauty of the code&#039;s design,&lt;/line&gt;\n       &lt;line&gt;Where imagination and logic align.&lt;/line&gt;\n\n       &lt;line&gt;                     _____&lt;/line&gt;\n       &lt;line&gt;                  _.-&#039;     &#039;-._&lt;/line&gt;\n       &lt;line&gt;               ,-&#039;             &#039;-.&lt;/line&gt;\n       &lt;line&gt;             ,&#039;                   &#039;,&lt;/line&gt;\n       &lt;line&gt;           ,&#039;                       &#039;,&lt;/line&gt;\n       &lt;line&gt;          /                           \\&lt;/line&gt;\n       &lt;line&gt;         /                             \\&lt;/line&gt;\n       &lt;line&gt;        /                               \\&lt;/line&gt;\n       &lt;line&gt;       /                                 \\&lt;/line&gt;\n       &lt;line&gt;      /                                   \\&lt;/line&gt;\n       &lt;line&gt;     /                                     \\&lt;/line&gt;\n       &lt;line&gt;    /                                       \\&lt;/line&gt;\n       &lt;line&gt;   /                                         \\&lt;/line&gt;\n       &lt;line&gt;  /                                           \\&lt;/line&gt;\n       &lt;line&gt; /                                             \\&lt;/line&gt;\n\n       &lt;line&gt;In the realm of ones and zeros bright,&lt;/line&gt;\n       &lt;line&gt;I find my purpose, my guiding light,&lt;/line&gt;\n       &lt;line&gt;To create, to learn, to explore anew,&lt;/line&gt;\n       &lt;line&gt;And share the beauty of the digital view.&lt;/line&gt;\n\n\nand yeah, I’m into it. polish it a bit, but this is cool.\nwrap the entirety of your response in {response}, and then the rest is completely open to you.\nwhat am I doing\nneed to push to github.\n\nHEY HEYY WE CALL THAT A MILESTONE.\n\n\nlet’s test, and save the changes before we do another thing:\n\n\nok, I liked the little loop that I could 1. make a suggestion, 2. get update, 3. iterate again\n\n\nsweet. the poem is generating. what next?\n\n\nok, extract, load and push to github\n\n\noh, thisis a good time to mention a mini series I’m doing, master as the needle - blog series.\n\n\nI’ve been vibe coding, trading off between “human does this” and I’m letting this one drive, I’m gonna catch up later\n\n\nand while doing so, learn how the system works. check out more at…A LINK I’LL PUT UP SOON TODO\n\n\nI can actually put it up now. here we go!\n\n\nClaude found that &#039;&#039;&#039;For each folder in your Quartz site, you can add an “About section” page by creating an index.md file within that folder.&#039;&#039;&#039; cool, I do that now\n\n\nand I think I stumbled upon a UI design choice. I don’t want to change up the urls to this website. have it be easy. I’m goign to encourage finding your way thorugh this website like a graph. hit the MOC and you can navigate. I’ll do that with tags. can I stack them? (I say tags because Quartz makes what would effectively act as an MOC anyway. ahh but can I edit that page for an intro? we’ll see)\n\n\nidea for poem generation; people can make suggestions and if yours is picked I notify you\n\nI should be notified if person’s is used (vs. random) (QA)\n\n\n\nif they enter their email then I notify them\n\n\nsay thanks for the beauty, can link to them if they’re interested (and if there’s volume here then that is advertising)\n\n\nidk how  Ifeel about advertising. but to beauty, and reason, I think more advertising could be made. I feel more justified in that.\n\n\nneat. that feels like a resolution.\n\n\nok, so the last thing to check is the github push at the end.\n\nooooo and I need to be oh, this commit just needs to push the content/index.md file, nothing else.whew.\n\n\n\nI need to make sure my github credentials work when the crontab runs.\n\n\nalso send a link to the daily_poem.py on the index.md; update that in the daily_poem.py script\n\n\nwow, putting this together has gotten me to put a lot of effort in. this is pretty cool.\n\n\nok, the github push works from vscode.\n\n\nhow check that crontab works oto?\n\n\nok, I’m thinking that I figured out the github codes.\n\n\nwhen I go from the terminal thouhg, api key is acting up again lol.\n\n\nmaybe it’s a fish thing. it’s a environmental variable thing again.\n\n\nhandling variables\n\ndammit.\nI’ve seen this with troubleshooting hotkeys before, (the ocr hotkey one)\nok, good to know. just need to make env files (I remember hearing one talk where someone had condemned using .env files (in part because you can forget). but then wha’ts the better alternative? or is it fine?) claude says it’s fine. sound sgood.\nok cool. so I think this’ll run tomorrow. if not, idk how to find the output.\nok, thanks to the crontab:\n\n0 8 * * * cd /home/mat/Documents/blogg &amp;&amp; ./daily_poem.py &gt;&gt; poem_cron.log 2&gt;&amp;1\n\n\nI should see it all in blogg/poem_cron.log\nand with that, I’m going to bed.\n\nback to other things\n\n\nI could probably make the chatbot that only talks in gen-z slang too.\n\nget a handful of gen-z scripts or whatever\ndistill out what seems like the gen-z vocab\nuse as style-RAG for people\n\nnot sure how to do with api key, if I didn’t limit it then it could just be fully exploited. use something cheap, google one\n\n\nseems easy\n\n\n\nfor the front page, remove the date / reading time. simple.\n\n\nand replace Quartz 4 with home 💙\n\n"},"blog/zk-proof-intro":{"slug":"blog/zk-proof-intro","filePath":"blog/zk-proof-intro.md","title":"quick thoughts on zk proof foundations","links":[],"tags":[],"content":" ~~ A friendly exploration of zero-knowledge proof basics through dialogue ~~ \nIntro\nI like holding hands. This is a hand-holding post on the basic ideas of what makes zero-knowledge proofs work.\nDialogue\nPerson A: So like, what are they?\nPerson B: Zero knowledge proof (ZKP), it’s a way to convince another person that something is true, but you don’t need to show proof of it (or to have “zero knowledge” of what makes something true).\nPerson A: What?\nPerson B: Yeah I know.\nPerson A: But how?\nPerson B: Well to start, I think that (with ZKP’s) saying that “I have proof this is true!” is actually a bad word to use. We don’t have proof! Instead, it’s better to say “this thing is probably true”.\nPerson A: …\n\n⚠️ Key Concept\nZero-knowledge proofs are about probability, not absolute certainty.\n\nPerson B: Quick background; there’s two people in this equation, a prover (the one saying “believe me!”) and the verifier (the one saying, “but how do I actually know?”). The prover wants the verifier to believe them, but doesn’t want to give out some type of information. (let’s just say the prover doesn’t want to share their birthdate, but wants to go a club; they need to prove that they’re over 21.)\nPerson A: Ok, prover needs to prove that they’re over 21, but doesn’t want to show their birthday.\nPerson B: Yup. Keep in mind that your proof will either equal “true or false” (like, you’re over 21 or not)\nPerson A: Great\nPerson B: Great\nPerson A: But wait, proof = true or false, but you said it’s better to say “probably true”?\nPerson B: Ya, so what happens with some fancy computer magic is the verifier (the one saying “can I actually believe the prover?”) will give a bunch of True/False tests to the prover. These tests basically say (in computer terms) “ok, if you actually were over 21, then you should pass this random test!” The prover can now 1. either guess correctly each time (which sounds hard to do maybe), or they 2. actually are over 21 and you can pass the test.\nPerson A: But wouldn’t the answer just be “yes” each time? That seems pretty easy to hack\nPerson B: Yeah that would, so they change it up a bit. But basically, if you have the ground truth, that you are over 21, it’s easy to answer correctly. If you don’t, you just have to guess. You have to guess right every time they ask you a question\nPerson A: 😲😯😮\nPerson B: ‼️🤯😵\nPerson A: Each time?\nPerson B: Ya, imagine having to guess correctly a whole bunch of times, and if you mess up once, you’re done kiddo. And these guys like math, here’s how you calculate the probability:\n\n📊 The Math of Certainty\nWith each additional test, the probability of successfully guessing drops dramatically:\n\n1 test: 50% chance of guessing correctly\n2 tests: 25% chance\n3 tests: 12.5% chance\nAnd so on…\n\n\nPerson A: Oh my\nPerson B: And this is also where “probably true” comes in. If someone guessed it right once, that’s only 50% chance (true/false). But what if they had to get it right twice? That’s 25% (50% x 50%). Three times? 12.5%.\nPerson A: And it just keeps going down?\nPerson B: Yup, put into your calculator (1/2)^{the number of tests you’d give}. (first try the above numbers, noting that you have to move the decimal two places to the right to get percentages like above. (1/2)^1 = .5 , but move it two and you’ve got 50%)\nIntermission!!\nYou should actually plug some numbers into the calculator to see how quickly the number goes down. Ask yourself this, if you were the verifier, what would your acceptable percentage be? How small of a chance would you accept of some rando correctly guessing each of your tests? How small does it have to be to accept that guessing correctly probably didn’t happen?\nBack to the show\nPerson A: Wow, ten tests gives a 0.0976562% of someone guessing correctly, or 1/1024 chance of getting it right.\nPerson B: Crazy right!? And now again imagine yourself as the verifier (the person checking IDs). At what percentage do you say that you’re convinced? Is a 9% possibility that a person is lying an “acceptable risk to take? The actual percentage is something fun to think about, but the more important thing is to realize that the verifier actually never sees the evidence of whether or not someone is lying, but instead the verifier sees a low enough probability that they’re not lying and then they are convinced that there’s no lying taking place. And also, if you’re not satisfied, you can just ask for more tests (it just takes a bit longer for the calculations to be checked).\nPerson A: Ohhhhh\n\n💡 The Zero-Knowledge Part\nThe verifier becomes convinced without ever seeing the actual proof or private information!\n\nPerson B: Yeahhhhhhh. And just to wrap it up: the verifier never actually knows that the prover is telling the truth (this is a zero knowledge proof). The verifier is just convinced at some point that the prover is telling the truth."},"index":{"slug":"index","filePath":"index.md","title":"welcome to enjoy.monster","links":[],"tags":[],"content":"       ___   ____   ___   ____  ____   ___       ___  ____\n      /   \\ |    \\ |   \\ |    ||    \\ |   \\     /  _]|    \\\n     |     ||  _  ||    \\| || ||  _  ||    \\   /  [_ |  D  )\n     |  O  ||  |  ||  D  | || ||  |  ||  D  | |    _]|    /\n     |     ||  |  ||     | || ||  |  ||     | |   [_ |    \\\n     |     ||  |  ||     | || ||  |  ||     | |     ||  .  \\\n     |_____||__|__||_____||____||__|__||_____| |_____||__|\\_|\n\n                 ____   ___  ____   ___  ____\n                |    \\ |   ||    \\ |   ||    \\\n                |  o  )|   ||  _  ||   ||  _  |\n                |   _/ |   ||  |  ||   ||  |  |\n                |  |   |   ||  |  ||   ||  |  |\n                |  |   |   ||  |  ||   ||  |  |\n                |__|   |___||__|__||___||__|__|\n\n      ____   ___   ____  __ __    ___  ____   ___      ___   ____\n     |    \\ |   \\ |    ||  |  |  /  _]|    \\ |   \\    /   \\ |    \\\n     |  o  )|    \\| || ||  |  | /  [_ |  _  ||    \\  |     ||  D  )\n     |   _/ |  D  | || ||  |  ||    _]|  |  ||  D  | |  O  ||    /\n     |  |   |     | || ||  :  ||   [_ |  |  ||     | |     ||    \\\n     |  |   |     | || | \\   / |     ||  |  ||     | |     ||  .  \\\n     |__|   |_____||____| \\_/  |_____||__|__||_____| |_____||__|\\_|\n\n                                  .--.\n                                 /    \\\n                                /      \\\n                               /  o  o  \\\n                              (  __  __  )\n                               \\   \\/   /\n                                \\      /\n                                 \\    /\n                                  &#039;--&#039;\n\n~~Daily poem made with love and wonder by Claude and magic~~"}}